УТ_для_edt/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РазрешеноИзменятьКоординаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартМенеджерСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартРабочийТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТС</name>
    <comment>#1352 смарт: Лопато 04.05.2023 //Звонки из 1С (через городской стационарный телефон)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнутреннихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДоступныДанныеВнешнихФизическихЛиц</name>
    <comment>#1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерВАТСДополнительный</name>
    <comment>//++ #Б-6744 смарт: Фролов 28.05.2026 //Перехват заявок. Загрузка звонков в 1С с нескольких мобильных менеджеров</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОповещениеОбИнтересах</name>
    <comment>//++ #Б-3560 смарт: Фролов 01.07.2025 //Создания механизма настройки оповещений о событиях с Интересами. </comment>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Новые</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Завершенные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оборудование</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Запчасти</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РасходныеМатериалы</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Прочее</name>
      <comment>//++ #Б-3858 смарт: Фролов 18.07.2025 //Расширение настройки отправки оповещений о обработке Интересов.</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектОповещения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартКонтролируемыеМенеджеры</name>
    <comment>//++ #Б-7838 смарт: Фролов 12.08.2026 //Уведомления для Беловой Т.</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Catalogs/Пользователи/Forms/CRM_ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказыватьНедействительныхПользователей = (CRM_ХранилищеНастроек.Загрузить("ПоказыватьНедействительныхПользователей") = Истина);
	
	Элементы.ФормаПоказыватьНедействительныхПользователей.Пометка = ПоказыватьНедействительныхПользователей;
	
	// Только если не режим выбора, делаем фильтрацию.
	
	Если ПоказыватьНедействительныхПользователей Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ПользователиСписок.Отбор, "Недействителен");
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ПользователиСписок.Отбор,
			"Недействителен",
			Ложь);
	КонецЕсли;
			
	ИспользоватьГруппы = ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей");
	
	Если ТипЗнч(Параметры.ТекущаяСтрока) = Тип("СправочникСсылка.ГруппыПользователей") Тогда
		Если ИспользоватьГруппы Тогда
			Элементы.ГруппыПользователей.ТекущаяСтрока = Параметры.ТекущаяСтрока;
		Иначе
			Параметры.ТекущаяСтрока = Неопределено;
		КонецЕсли;
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ГруппаПользователей", Параметры.ТекущаяСтрока);
	Иначе
		ТекущийЭлемент = Элементы.ПользователиСписок;
		Элементы.ГруппыПользователей.ТекущаяСтрока = Справочники.ГруппыПользователей.ВсеПользователи;
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ГруппаПользователей", Справочники.ГруппыПользователей.ВсеПользователи);
	КонецЕсли;
	
	Если CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		ИспользоватьПодразделения = Истина;
	Иначе	
		ИмяОпции = "ИспользоватьПодразделения";
		ИспользоватьПодразделения = ПолучитьФункциональнуюОпцию(ИмяОпции);
	КонецЕсли;	
	
	ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ВыбиратьИерархически", Истина);
	
	Если НЕ ИспользоватьГруппы Тогда
		Параметры.ВыборГруппПользователей = Ложь;
		Элементы.ГруппаПоказыватьПользователейДочернихГрупп.Видимость = Ложь;
		Элементы.СоздатьГруппуПользователей.Видимость = Ложь;
	КонецЕсли;
	
	// Настройка постоянных данных для списка пользователей.
	ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ПустойУникальныйИдентификатор", Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000"));
	ГруппаПользователейВсеПользователи = Справочники.ГруппыПользователей.ВсеПользователи;
	
	Если НЕ ПравоДоступа("Добавление", Метаданные.Справочники.ГруппыПользователей) Тогда
		Элементы.СоздатьГруппуПользователей.Видимость = Ложь;
	КонецЕсли;
	Если НЕ ПравоДоступа("Добавление", Метаданные.Справочники.Пользователи) Тогда
		Элементы.СоздатьПользователя.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ПользователиСписок.РежимВыбора = Параметры.РежимВыбора;
	Если Параметры.РежимВыбора Тогда
		
		РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		Если Элементы.Найти("ПользователиИБ") <> Неопределено Тогда
			Элементы.ПользователиИБ.Видимость = Ложь;
		КонецЕсли;
		
		// Отбор не помеченных на удаление.
		
		//ПользователиСписок.Отбор.Элементы[0].Использование = Истина;
		
		Элементы.ПользователиСписок.РежимВыбора        =    Истина;
		Элементы.ГруппыПользователей.РежимВыбора       =    Параметры.ВыборГруппПользователей;
		Элементы.Подразделения.РежимВыбора		       =    Параметры.ВыборГруппПользователей;
		Элементы.ВыбратьГруппуПользователей.Видимость  =    Параметры.ВыборГруппПользователей;
		Если Элементы.Найти("ВыбратьПользователя")<>Неопределено Тогда
			Элементы.ВыбратьПользователя.КнопкаПоУмолчанию = НЕ Параметры.ВыборГруппПользователей;
		КонецЕсли;
		
		Если Параметры.ЗакрыватьПриВыборе = Ложь Тогда
			// Режим подбора
			Элементы.ПользователиСписок.МножественныйВыбор = Истина;
			Элементы.ПользователиСписок.РежимВыделения = РежимВыделенияТаблицы.Множественный;
			
			Если Параметры.ВыборГруппПользователей Тогда
				Заголовок                                     = НСтр("ru='Подбор пользователей и групп';en='Selection of users and groups'");
				Если Элементы.Найти("ВыбратьПользователя")<>Неопределено Тогда
					Элементы.ВыбратьПользователя.Заголовок        = НСтр("ru='Выбрать пользователей';en='Select users'");
				КонецЕсли;
				
				Элементы.ВыбратьГруппуПользователей.Заголовок = НСтр("ru='Выбрать группы';en='Selected groups'");
				
				Элементы.ГруппыПользователей.МножественныйВыбор = Истина;
				Элементы.ГруппыПользователей.РежимВыделения = РежимВыделенияТаблицы.Множественный;
			Иначе
				Заголовок                                     = НСтр("ru='Подбор пользователей';en='Selection of users'");
			КонецЕсли;
		Иначе
			Если Параметры.ВыборГруппПользователей Тогда
				Заголовок                                     = НСтр("ru='Выбор пользователя или группы';en='Select user or group'");
				Если Элементы.Найти("ВыбратьПользователя")<>Неопределено Тогда
					Элементы.ВыбратьПользователя.Заголовок        = НСтр("ru='Выбрать пользователя';en='Select user'");
				КонецЕсли;
			Иначе
				Заголовок                                     = НСтр("ru='Выбор пользователя';en='Select user'");
			КонецЕсли;
		КонецЕсли;
	Иначе
		Если Элементы.Найти("ВыбратьПользователя")<>Неопределено Тогда
			Элементы.ВыбратьПользователя.Видимость        = Ложь;
		КонецЕсли;
		Элементы.ВыбратьГруппуПользователей.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.АдресКартинки.Видимость	= ИспользоватьГруппы И ПоказатьСкрытьИзображениеПометка;
	Элементы.ГруппаКартинки.Видимость	= НЕ ИспользоватьГруппы И ПоказатьСкрытьИзображениеПометка;
	
	Если Параметры.РежимВыбора И Параметры.Свойство("ТолькоГруппы") Тогда
		Если Элементы.Найти("ВыбратьПользователя")<>Неопределено Тогда
			Элементы.ВыбратьПользователя.Видимость	= НЕ Параметры.ТолькоГруппы;
		КонецЕсли;
		Элементы.ГруппаСписокКартинка.Видимость = НЕ Параметры.ТолькоГруппы;
		Элементы.ГруппаПоказыватьПользователейДочернихГрупп.Видимость = НЕ Параметры.ТолькоГруппы 
	КонецЕсли;
	
	Если Параметры.Свойство("ТолькоДоступные") Тогда
		ТолькоДоступные = Параметры.ТолькоДоступные;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей") Тогда
		Элементы.РежимПодбора.Видимость = Ложь;
	КонецЕсли;
	
	Если НЕ ИспользоватьПодразделения Тогда
		Элементы.РежимПодбора.Видимость = Ложь;
	КонецЕсли;
	
	РежимПодбора = "ПоПодразделениям";
	
	// Скрытие переданного пользователя из формы выбора пользователей.
	Если ТипЗнч(Параметры.СкрываемыеПользователи) = Тип("СписокЗначений") Тогда
		
		ВидСравненияКД = ВидСравненияКомпоновкиДанных.НеВСписке;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			ПользователиСписок,
			"Ссылка",
			Параметры.СкрываемыеПользователи,
			ВидСравненияКД);
		
	КонецЕсли;
	
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// +Доступные пользователи
	ПолучитьБезОрганичений = Ложь;
	Если Параметры.Свойство("ПолучитьБезОрганичений") Тогда
		ПолучитьБезОрганичений = Истина;
	КонецЕсли;
	МассивЭлементовОтбора = Новый Массив;
	МассивЭлементовОтбора.Добавить("Ссылка");
	УстановитьОтборВСпискеПоДоступнымпользователям(ПользователиСписок, МассивЭлементовОтбора,,, ПолучитьБезОрганичений);
	// -Доступные пользователи
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//++ #Б-7440 смарт: Фролов 15.07.2026 //Взаимодействие. Выездная встреча. Доработка.
	АвторВзаимодействия = Неопределено;
	
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения")
		И ВладелецФормы.ИмяФормы = "Документ.CRM_Взаимодействие.Форма.ФормаДокумента" Тогда
		
		Если ВладелецФормы.Параметры.Свойство("Ключ") И ЗначениеЗаполнено(ВладелецФормы.Параметры.Ключ) Тогда
			
			АвторВзаимодействия = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ВладелецФормы.Параметры.Ключ, "Автор");
			
		КонецЕсли;
		
	КонецЕсли;
	
	//++ #1441 смарт: Фролов 31.08.2023 //Исправить фильтр по ответственному Взаимодейстиве на начальной странице  
	//смартУстановитьОтборВСпискеПоДоступнымпользователям();
	смартУстановитьОтборВСпискеПоДоступнымпользователям(АвторВзаимодействия);
	//-- #1441 смарт: Фролов 31.08.2023
	//-- #Б-7440 смарт: Фролов 15.07.2026
	
	Если ТолькоДоступные Тогда
		УстановитьОтборПоДоступнымПодразделениям();
		УстановитьОтборПоДоступнымПользователям();
	Иначе
		//CRM_ОбщегоНазначенияКлиентСервер.УдалитьЭлементОтбораСписка(ПользователиСписок, "Ссылка");
		//CRM_ОбщегоНазначенияКлиентСервер.УдалитьЭлементОтбораСписка(Подразделения, "Ссылка");
	КонецЕсли;
	РежимПодбораПриИзменении(Неопределено);
	ОбновитьСодержимоеФормыПриИзмененииГруппы();  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзмененСоставГруппыПользователей" Тогда
		Если Параметр = Элементы.ГруппыПользователей.ТекущаяСтрока Тогда
			Элементы.ПользователиСписок.Обновить();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ИзмененПользовательИБ" Тогда
		Если Элементы.ПользователиСписок = Источник.ВладелецФормы Тогда
			СписокПриАктивизацииСтрокиНаСервере(Элементы.ПользователиСписок.ТекущаяСтрока);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Настройки[ВыбиратьИерархически] = Неопределено Тогда
		ВыбиратьИерархически = Истина;
	КонецЕсли;
	
	Если НЕ Настройки["ПоказатьСкрытьИзображениеПометка"] = Неопределено Тогда
		ПоказатьСкрытьИзображениеПометка	= Настройки["ПоказатьСкрытьИзображениеПометка"];
	Иначе
		ПоказатьСкрытьИзображениеПометка	= Ложь;
	КонецЕсли;
	
	Если Настройки["РежимПодбора"] = Неопределено ИЛИ (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьГруппыПользователей") И Настройки["РежимПодбора"]<>"ПоПодразделениям") Тогда
		Настройки["РежимПодбора"] = "ПоПодразделениям";
	КонецЕсли;
	
	Элементы.ПоказатьСкрытьИзображение.Пометка	= ПоказатьСкрытьИзображениеПометка;
	Элементы.ГруппаКартинки.Видимость			= НЕ ИспользоватьГруппы И ПоказатьСкрытьИзображениеПометка;
	Элементы.АдресКартинки.Видимость			= ИспользоватьГруппы И ПоказатьСкрытьИзображениеПометка;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры и функции формы.
//

&НаКлиенте
Процедура ОбновитьСодержимоеФормыПриИзмененииГруппы()
	
	Если РежимПодбора = "ПоГруппам" Тогда
		Если НЕ ИспользоватьГруппы
		 ИЛИ Элементы.ГруппыПользователей.ТекущаяСтрока = ГруппаПользователейВсеПользователи Тогда
			//
			Элементы.ГруппаПоказыватьПользователейДочернихГрупп.ТекущаяСтраница = Элементы.ГруппаНельзяУстановитьСвойство;
			ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ВыбиратьИерархически", Истина);
			ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ГруппаПользователей", ГруппаПользователейВсеПользователи);
		Иначе
			Элементы.ГруппаПоказыватьПользователейДочернихГрупп.ТекущаяСтраница = Элементы.ГруппаУстановитьСвойство;
			ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ВыбиратьИерархически", ВыбиратьИерархически);
			ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ГруппаПользователей", Элементы.ГруппыПользователей.ТекущаяСтрока);
		КонецЕсли;
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "Подразделение", ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
		ТекПодразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
	Иначе
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ВыбиратьИерархически", Истина);
		ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "ГруппаПользователей", ГруппаПользователейВсеПользователи);
		Если ИспользоватьПодразделения Тогда
			ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "Подразделение", Элементы.Подразделения.ТекущаяСтрока);
			ТекПодразделение = Элементы.Подразделения.ТекущаяСтрока;
		Иначе	
			ОбновитьЗначениеПараметраКомпоновкиДанных(ПользователиСписок, "Подразделение", ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка"));
			ТекПодразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьЗначениеПараметраКомпоновкиДанных(Знач ВладелецПараметров, Знач ИмяПараметра, Знач ЗначениеПараметра)
	
	Для каждого Параметр Из ВладелецПараметров.Параметры.Элементы Цикл
		Если Строка(Параметр.Параметр) = ИмяПараметра Тогда
			Если Параметр.Использование И Параметр.Значение = ЗначениеПараметра Тогда
				Возврат;
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	ВладелецПараметров.Параметры.УстановитьЗначениеПараметра(ИмяПараметра, ЗначениеПараметра);
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказыватьНедействительныхПользователей(Команда)
	
	ПоказыватьНедействительныхПользователей = Не ПоказыватьНедействительныхПользователей;
	
	Элементы.ФормаПоказыватьНедействительныхПользователей.Пометка = ПоказыватьНедействительныхПользователей;
	
	CRM_ХранилищеНастроек.Сохранить("ПоказыватьНедействительныхПользователей", "", ПоказыватьНедействительныхПользователей);
	
	Если ПоказыватьНедействительныхПользователей Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(ПользователиСписок.Отбор, "Недействителен");
	Иначе	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			ПользователиСписок.Отбор,
			"Недействителен",
			Ложь);
	КонецЕсли;
		
КонецПроцедуры


// +CRM

&НаСервере
Процедура ВывестиНедоступностьКартинки(ТекущаяСтрокаСписка)
	АдресКартинки = "";
	Элементы.АдресКартинки.ТекстНевыбраннойКартинки
		= НСтр("ru='Картинка не доступна (не доступен том) обратитесь к администратору.';en='Picture unavailable (volume unavailable) of contact the administrator.'");
КонецПроцедуры // ВывестиНедоступностьКартинки()

&НаСервереБезКонтекста
Функция ПолучитьНавигационнуюСсылкуКартинки(ФайлКартинки, ИдентификаторФормы)
	
	Попытка
		УстановитьПривилегированныйРежим(Истина);
		Возврат РаботаСФайлами.ДанныеФайла(ФайлКартинки, ИдентификаторФормы).СсылкаНаДвоичныеДанныеФайла;
	Исключение
		Возврат "";
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере(ТекущаяСтрокаСписка)
	Если НЕ ТекущаяСтрокаСписка = Неопределено Тогда
		Если НЕ ТекущаяСтрокаСписка.CRM_Фотография.Пустая() Тогда
			АдресКартинки = ПолучитьНавигационнуюСсылкуКартинки(ТекущаяСтрокаСписка.CRM_Фотография, УникальныйИдентификатор);
			Если ПустаяСтрока(АдресКартинки) Тогда
				ВывестиНедоступностьКартинки(ТекущаяСтрокаСписка);
			КонецЕсли;	
		Иначе
			АдресКартинки = "";
		КонецЕсли;
	Иначе
		АдресКартинки = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработчикОжиданияСписокПриАктивизацииСтроки()
	СписокПриАктивизацииСтрокиНаСервере(Элементы.ПользователиСписок.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ПользователиСписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("Подключаемый_ОбработчикОжиданияСписокПриАктивизацииСтроки", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьИзображение(Команда)
	
	Элементы.ПоказатьСкрытьИзображение.Пометка	= НЕ Элементы.ПоказатьСкрытьИзображение.Пометка;
	ПоказатьСкрытьИзображениеПометка	= Элементы.ПоказатьСкрытьИзображение.Пометка;
	Элементы.ГруппаКартинки.Видимость			= НЕ ИспользоватьГруппы И ПоказатьСкрытьИзображениеПометка;
	Элементы.АдресКартинки.Видимость			= ИспользоватьГруппы И ПоказатьСкрытьИзображениеПометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияПриАктивизацииСтроки(Элемент)
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
КонецПроцедуры

&НаКлиенте
Процедура РежимПодбораПриИзменении(Элемент)

	Если РежимПодбора = "ПоГруппам" Тогда
		Элементы.ГруппаДеревоКартинка.Видимость	= Истина;
		Элементы.ГруппаДеревоПодразделения.Видимость = Ложь;
		Элементы.СоздатьГруппуПользователей.Доступность = Истина;
	Иначе
		Элементы.ГруппаДеревоКартинка.Видимость	= Ложь;
		Элементы.ГруппаДеревоПодразделения.Видимость = Истина;
		Элементы.СоздатьГруппуПользователей.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовогоПользователя(Команда)
	ОткрытьФорму("Справочник.Пользователи.ФормаОбъекта", Новый Структура("Основание", ТекПодразделение));
КонецПроцедуры

// -CRM

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий команд и элементов формы.
//

&НаКлиенте
Процедура СоздатьГруппуПользователей(Команда)
	
	Элементы.ГруппыПользователей.ДобавитьСтроку();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПользователейПриАктивизацииСтроки(Элемент)
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПользователейВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОповеститьОВыборе(Значение);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппыПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если НЕ Копирование Тогда
		Отказ = Истина;
		ПараметрыФормы = Новый Структура;
		
		Если ЗначениеЗаполнено(Элементы.ГруппыПользователей.ТекущаяСтрока) Тогда
			
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Родитель", Элементы.ГруппыПользователей.ТекущаяСтрока));
		КонецЕсли;
		
		ОткрытьФорму("Справочник.ГруппыПользователей.ФормаОбъекта", ПараметрыФормы, Элементы.ГруппыПользователей);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделенияВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОповеститьОВыборе(Значение);
КонецПроцедуры

&НаКлиенте
Процедура ПользователиСписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Если Элементы.ПользователиСписок.РежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		ОповеститьОВыборе(Значение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиСписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ГруппаНовогоПользователя", Элементы.ГруппыПользователей.ТекущаяСтрока);
	
	Если Копирование И Элемент.ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы.Вставить("ЗначениеКопирования", Элемент.ТекущаяСтрока);
	КонецЕсли;
	
	Если НЕ Копирование Тогда
		Если НЕ Параметры.ПараметрыНового = Неопределено Тогда
			ПараметрыФормы.Вставить("ПараметрыНового",Параметры.ПараметрыНового);
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.Пользователи.ФормаОбъекта", ПараметрыФормы, Элементы.ПользователиСписок);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбиратьИерархическиПриИзменении(Элемент)
	
	ОбновитьСодержимоеФормыПриИзмененииГруппы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы
//
&НаСервере
Процедура УстановитьОтборПоДоступнымПользователям()
	СписокДоступныхПользователей = ПолучитьСписокДоступныхПользователей();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ПользователиСписок, "Ссылка", СписокДоступныхПользователей, ВидСравненияКомпоновкиДанных.ВСписке);
КонецПроцедуры	

&НаСервере
Процедура УстановитьОтборПоДоступнымПодразделениям()
	СписокДоступныхПодразделений = ПолучитьСписокДоступныхПодразделений();
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Подразделения, "Ссылка", СписокДоступныхПодразделений, ВидСравненияКомпоновкиДанных.ВСписке);
КонецПроцедуры

#КонецОбласти 

#Область ДоработкиСмарт

&НаСервере
//++ #1441 смарт: Фролов 31.08.2023 //Исправить фильтр по ответственному Взаимодейстиве на начальной странице  
//++ #Б-7440 смарт: Фролов 15.07.2026 //Взаимодействие. Выездная встреча. Доработка.
//Процедура смартУстановитьОтборВСпискеПоДоступнымпользователям()
Процедура смартУстановитьОтборВСпискеПоДоступнымпользователям(АвторВзаимодействия = Неопределено)
//-- #Б-7440 смарт: Фролов 15.07.2026	
	CRM_ОбщегоНазначенияКлиентСервер.УдалитьЭлементОтбораСписка(ПользователиСписок, "Ссылка");
	//++ #Б-7440 смарт: Фролов 15.07.2026 //Взаимодействие. Выездная встреча. Доработка.
	//Если НЕ Пользователи.РолиДоступны("ПолныеПрава,смартРуководительCRM") Тогда
	Если НЕ Пользователи.РолиДоступны("ПолныеПрава,смартРуководительCRM") И НЕ АвторВзаимодействия = Пользователи.ТекущийПользователь() Тогда
	//-- #Б-7440 смарт: Фролов 15.07.2026
		МассивДоступныхПользователей=Новый Массив;
		МассивДоступныхПользователей.Добавить(ПараметрыСеанса.ТекущийПользователь);
	//++ #Б-7440 смарт: Фролов 15.07.2026 //Взаимодействие. Выездная встреча. Доработка.	
	ИначеЕсли АвторВзаимодействия = Пользователи.ТекущийПользователь() Тогда
		МассивДоступныхПользователей = ПолучитьДоступныхМенеджеров(Истина);
	//-- #Б-7440 смарт: Фролов 15.07.2026	
	Иначе	
		МассивДоступныхПользователей = ПолучитьДоступныхМенеджеров(Ложь);
	КонецЕсли;	
	CRM_ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораСписка(ПользователиСписок, "Ссылка", МассивДоступныхПользователей, ВидСравненияКомпоновкиДанных.ВСписке);
КонецПроцедуры	//-- #1441 смарт: Фролов 31.08.2023

#КонецОбласти
